Revit 2027 API
Noise.TextureRealWorldOffsetZ Property
 The property labeled "Offset Z" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureRealWorldOffsetZ { get; }
Public Shared ReadOnly Property TextureRealWorldOffsetZ As String
	Get
public:
static property String^ TextureRealWorldOffsetZ {
	String^ get ();
}
static member TextureRealWorldOffsetZ : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
Noise Class
Autodesk.Revit.DB.Visual Namespace